Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་དག་ མི འི་ འཇིག་རྟེན་ ཐམས་ཅད་ ལ་ བདེ་བ ར་ བྱེད་པ་ དང་ །_ གནོད་པ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: The righteous nāga kings bring happiness to the entire human world, whereas the latter cause harm there.

source: གནས་ དེ འི་ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་པ་ རྣམས་ གང་ དུ་ གནས་པ་ དེར་ ཀླུ འི་ རྡུལ་ དག་ མི་ འབབ་བོ །_། གང་ དུ་ ཆོས་ དང་ མི་ ལྡན་པ་ དག་ གནས་པ་ དེར་ ཀླུ འི་ རྡུལ་ དག་ འབབ་པ ར་ འགྱུར་ ཏེ དེ་ཡང་ བྱེ་མ་ རབ་ཏུ་ འབར་བ་ འདྲ་ ལ་མགོ་ ལ་ འབབ་བོ །_།
en: Moreover, within the realms of the righteous nāga kings, there is no rain of nāga particles, which are particles that feel like burning sand falling on their heads.

source: དེས་ ཀླུ འི་ རྒྱལ་པོ་ དེ་དག་ ཀུན་ གྱི་ གནས་ རབ་ཏུ་ སྲེག་པ ར་ བྱེད་ ལ །_ དེས་ ཀླུ འི་ བུ་སྨད་ དུ་ གཏོགས་པ་ ཐམས་ཅད་ ཀྱང་ སྲེག་པ ར་ བྱེད་ དེ དེ་ནས་ ཡང་ འབྱུང་བ ར་ བྱེད་པ་ མཐོང་ ངོ་ །_།
en: However, throughout the realms of the unrighteous nāga kings, such particles do pour down, and thus they burn all the female nāgas there. This happens repeatedly.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ཀླུ་ རྣམས་ ཀྱི་ ཀླུ འི་ རྡུལ་ གྱི་ རྒྱུ ར་ གྱུར་པ་ དང་ །_ ལས་ ལ་ རྗེས་སུ་ སེམས་པ ར་ བྱེད་ དེ །_ ལས་ གང་ གིས་ ཀླུ་ དེ་དག་ གི་ རྡུལ་ དུ་ འགྱུར་ སྙམ་ ནས །_
en: $38 “The monk who has knowledge of the ripening of karmic effects will contemplate the causes of the nāga particles and their related karmic actions, wondering what acts cause the nāga particles to fall.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ཁྲོ་བ ས་ ཟིལ་ གྱིས་ ནོན་ ཅིང་ བུས་པ འི་ བློ་ ཅན་ ནམ །_ རྨོངས་པ འི་ བློ་ ཅན་ གང་ གིས་ དགེ་འདུན་ གྱི་ གཙུག་ལག་ཁང་ ངམ །_ གྲོང་ ངམ །_ གྲོང་ཁྱེར་ རམ །_ གྲོང་རྡལ་ མེས་ བསྲེགས་ ན །_
en: As he examines this with knowledge derived from hearing, he will notice how some people who are overcome and driven by anger, or who are deluded, set fire to the temples of the saṅgha, or to villages, towns, or markets.

source: དེ་ ལུས་ དང་ བྲལ་ ནས་ སེམས་ཅན་ དམྱལ་བ འི་ ནང་ དུ་ སྐྱེ་བ ར་ [3b] འགྱུར་ རོ །_།
en: When such people later separate from their bodies, they will be born in hell. [3.b]

source: དེ་ནས་ ཐར་ ནས་ དུད་འགྲོ་ ཀླུ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ ཏེ །_ དེ་ སྔོན་ མེས་ བསྲེགས་པ འི་ ཉེས་པ འི་ རྒྱུ་ དེས །_ དེ་ ལ་ འབབ་པ འི་ ཕྱིར་ ཀླུ འི་ རྡུལ་ འབབ་པ ར་ མཐོང་ ངོ་ །_།
en: When they escape from there, they will be born among the nāgas, where, due to their earlier misdeeds of arson, they will be bombarded by the falling nāga particles.

source: དེ་ནས་ ཡང་ དགེ་སློང་ དེ་ ཀླུ འི་ འཇིག་རྟེན་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $39 “The monk will further examine the world of the nāgas, wondering what actions may cause one to be born where no nāga particles fall.

source: ལས་ གང་ གིས་ ཀླུ་ རྣམས་ ལ་ ཀླུ འི་ བྱེ་མ་ མི་ འབབ་ ཅིང་ ལས་ གང་ གིས་ དེར་ སྐྱེ་བ ར་ འགྱུར་ སྙམ་ ནས །_ དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གང་ མུ་སྟེགས་ སུ་ གྱུར་ ཅིང་ འཇིག་རྟེན་པ འི་ ཀུན་ ནས་ ཉོན་མོངས་པ འི་ ཚུལ་ ཅན་ ཡིན་ ལ །_ དེ་ སྦྱིན་པ་ ཚེར་མ་ དང་ བཅས་པ་ ཡང་ བྱིན་ ན །_ སྔ་མ་ བཞིན་ ཚེར་མ་ བདུན་ གྱི་ ནང་ དུ་ སྐྱེས་ ལ །_
en: Investigating with knowledge derived from hearing, he will notice how some non-Buddhists with mundane afflictions give thorn-like gifts, and are born within ‘seven thorns’ in the way that was described earlier.#214

source: ཁྲོས་པ ས་ ཀྱང་ བསྒྲིབས་ ནས་ འདི་ལྟར་ ཀླུ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ གྱུར་ཅིག་ ཅེས་ ཀླུ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྨོན་ལམ་ བཏབ་ ན
en: While obscured by anger they may thus pray to be born among the nāgas.

source: དེ་ ལུས་ དང་ བྲལ་ ནས་ ངན་འགྲོ་ ལོག་པ ར་ ལྟུང་བ་ ལོངས་སྤྱོད་ ལྡན་ གྱི་ ཀླུ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ རོ །_།
en: When such people later separate from their bodies, they will fall into the lower realms and be born among the nāgas.

source: དེར་ སྐྱེས་ ནས་ ཀྱང་ ཧ་ཅང་ ཁྲོ་བ འི་ རང་བཞིན་ ཅན་ དུ་ མི་ འགྱུར་ ལ །_ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ ར་ འགྱུར་ ཏེ །_
en: However, once born as nāgas, rather than having an aggressive nature, they will be righteous and practice the Dharma.

source: དེ་ ལ་ ཀླུ འི་ རྡུལ་ དེ་ མི་ འབབ་ ཅིང་ མགོ་ ལ་ ཡང་ མི་ འབབ་བོ །_།
en: Thus, nāga particles will not fall upon their heads.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ཀླུ འི་ འཇིག་རྟེན་ ལ་ རྟོག་པ ར་ བྱེད་ དེ ལས་ གང་ གིས་ ཀླུ་ རྣམས་ ཀྱི་ གནས་ ལོངས་སྤྱོད་ ལྡན་ ན །_ ཆོས་ དང་ ལྡན་པ འི་ ཀླུ་ དེ་དག་ རྣམ་པ་ དུ་ཡོད །_ ཆོས་ དང་ མི་ ལྡན་པ་ དེ་དག་ རྣམ་པ་ དུ་ཡོད་ སྙམ་ ནས །_
en: $40 “As the monk who has knowledge of the ripening of karmic effects continues to examine the world of the nāgas, he will wonder, ‘Karmic actions cause beings to take birth as nāgas in Endowed with Enjoyments, yet how many kinds of righteous nāgas are there, and how many unrighteous nāgas are there?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གང་ དུ་ ཆོས་ དང་ ལྡན་པ་ དག་ གནས་པ་ དེར་ ནི་ རིན་པོ་ཆེ འི་ ར་བ ས་ བསྐོར་ ཅིང་ རིན་པོ་ཆེ་ སྣ་ བདུན་ འབྱུང་ ལ །_
en: $41 “Investigating with knowledge derived from hearing, he will notice how the righteous nāgas live in abodes encircled by jewel fences made of the seven precious substances.

source: ཀུན་ ནས་ འོད་ འབྱུང་ སྟེ །_ ལྟེང་ཀ་ དང་ །_ འབབ་ཆུ་ དང་ །_ ཨུད་པ་ ལ་ ཕུན་སུམ་ ཚོགས་པ་ ནི་ སྐྱེ །_
en: Their abodes are radiant and feature perfect ponds, cascades, and blue lotuses.

source: བདུད་རྩི འི་ ཁ་ཟས་ ལ་ ནི་ ཟ །_ རྟག་ ཏུ་ བདེ་བ་ ལ་ ནི་ གནས །_
en: The nāgas there live on elixir and are always happy.

source: ལུས་ མེ་ཏོག་ དང་ །_ ཕྱེ་མ་ དང་ །_ བྱུག་པ ས་ ནི་ བརྒྱན །_
en: Their bodies are adorned with flowers, powders, and ointments.

source: མགོ་ སྦྲུལ་ དུ་ འདུག་པ་ ཁོ་ན ར་ ཟད་ ལ །_ གཞན་ དུ་ ན་ འདོད་པ འི་ གཟུགས་ཅན་ དུ་ འགྱུར་ ཏེ །_ གང་ དུ་ རབ་ཏུ་ འགྲོ་བ ར་ འདོད་པ་ དང་ །_ གང་ དུ་ རྣམ་པར་ རྒྱུ་བ ར་ འདོད་པ་ དེར་ སོ་སོ ར་ གནས་པ ར་ བྱེད་ དོ །_།
en: While they all have the head of a serpent, they can nevertheless transform themselves into any form they like. Wherever they wish to proceed or relocate to, they will appear there.

source: དེ་ ལ་ ཀླུ འི་ རྒྱལ་པོ་ འདི་ རྣམས་ ནི་ ཆོས་ དང་ ལྡན་པ་ ཡིན་ ཏེ །_ འདི་ [4a] ལྟ་ སྟེ །_ མགོ་ བདུན་པ་ དང་ །_ གླང་པོ འི་ གདོང་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ དེ་བཞིན་ དུ་ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ བཟང་ལྡན་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ སྐྱེད་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ མི་ འཇོམས་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ སྤྲིན་ ཕྲེང་ ཅན་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ འཁྱིལ་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ཀུན་འགྲོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ སྤྲོ་ སྟེ །_
en: $42 “The righteous nāga kings are the following: [4.a] Seven-Headed, Gajānana, the nāga king Vāsuki, the nāga king Takṣaka, the nāga king Bhadraka, the nāga king Janaka, the nāga king Undefeatable, the nāga king Meghamālin, the nāga king Kuṇḍalin, and the nāga king Shining.

source: ཀླུ འི་ རྒྱལ་པོ་ འདི་ རྣམས་ ནི་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ ཡིན་ ནོ །_།
en: All these nāga kings are righteous and follow the Dharma.

source: དེ་ རྣམས་ ནི་ ལོ་ལེགས་ པར་ བྱ་བ འི་ ཕྱིར་དུ ས་ སུ་ འབབ་པ འི་ ཆར་ མི་ ཉུང་བ ར་ བདེ་བ ར་ འབེབས་པ ར་ བྱེད་ ལ །_ དུས་ མ་ཡིན་པ ར་ འབྱུང་བ འི་ སེར་བ་ དང་ །_ སྤྲིན་ དང་ །_ རླུང་ དག་ གཏོང་བ ར་ མི་ བྱེད་ དོ །_།
en: To ensure fine harvests, they bring timely, sufficient, and delightful rainfall, and they will not cause untimely hail, clouds, or winds.

source: སངས་རྒྱས་ དང་ །_ ཆོས་ དང་ །_ དགེ་འདུན་ ལ་ དད་ ཅིང་ དད་པས་ རྗེས་སུ་ འཇུག་པ་ ཡིན །_
en: They have faith in the Buddha, Dharma, and Saṅgha, and follow them with faith.

source: སངས་རྒྱས་ ཀྱི་ སྐུ་གདུང་ སྲུང་ ལ །_
en: They also protect buddha relics.

source: ཀླུ འི་ རྡུལ་ དང་ བྲལ་བ ས་ ཤིན་ཏུ་ བདེ་བ་ ཡིན་ ནོ །_། དེ་ཡང་ མི འི་ གནས་ བཞི་ ལ་ འདི་ལྟ་སྟེ །_
en: Since no nāga particles fall on them, their lives are very pleasant. $43 “These nāgas will make rain shower down on the four human abodes:

source: འཛམ་བུ འི་ གླིང་ དང་ །_ ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ དང་ །_ ཤར་ གྱི་ ལུས་འཕགས་ དང་ །_ བྱང་ གི་ སྒྲ་ མི་ སྙན་ རྣམས་ སུ་ ཆར་ འབེབས་པ ར་ བྱེད་ དེ །_
en: Jambudvīpa, Godānīya in the west, Videha in the east, and Kuru in the north.

source: གང་ གི་ ཚེ་ དགེ་སྦྱོང་ དང་ །_ བྲམ་ཟེ་ དག་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ འབྱུང་བ་ དེ འི་ ཚེ །_ ཆོས་ ཀྱི་ བྱེ་བྲག་ གིས་ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་པ་ དག་ སྟོབས་ རབ་ཏུ་ ཆེ་བ ར་ འགྱུར་ ཏེ
en: Whenever mendicants, brahmins, and people in general are righteous and follow the Dharma, the strength of these nāga kings will, as a unique effect of the Dharma, increase.

source: དེ འི་ ཚེ་ ཆར་ ལེགས་པ ར་ འབེབས་པ ར་ བྱེད་ ཅིང་ དེ འི་ ཚེ་ལོ་ ལེགས་པ ར་ འགྱུར་ ལ །_ དྲི་ དང་ རོ་ ཁ་དོག་ ཕུན་སུམ་ ཚོགས་པ ར་ འགྱུར །_
en: They will then send abundant rain and there will be fine crops with exquisite smell, taste, and color.

source: འགྲོ་བ་ དང་ །_ དུག་ དང་ །_ རླུང་ གཞན་ གྱིས་ གནོད་པ ར་ བྱེད་པ ར་ མི་ འགྱུར་ ཞིང་ །_
en: These nāga kings will not create any harmful disturbances, poisons, or winds.

source: འབྲས་བུ་ བཟང་པོ་ འབྱུང་བ ར་ འགྱུར་ ལ །_ ཉི་མ་ དང་ ཟླ་བ འི་ འོད་ དག་ གིས་ གནོད་པ ར་ མི་ འགྱུར །_
en: Fine fruits will grow forth and no one will be harmed by the light of the sun or the moon.

source: ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་པ་ རྣམས་ ནི་ ཀླུ འི་ གདུག་པ་ དང་ རླུང་ དག་ གཏོང་བ ར་ མི་ བྱེད་ དོ །_།
en: The righteous nāga kings will not create any nāga trouble, and they will not rouse storms.

source: འཛམ་བུ འི་ གླིང་ གི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སྲོག་ གི་ བར་ཆད་ ནི་ རྒྱུ་ བཞི ས་ བྱེད་ དེ །_ འདི་ལྟ་སྟེ །_ ལོ་ཉེས་ དང་ །_ མཚོན་ གྱིས་ འཁྲུགས་པ་ དང་ །_ དུག་ དང་ །_ རླུང་ གིས་ རེག་པ་ དང་ །_ ཆུ འི་ ཉེས་པ འོ །_།
en: $44 “Four factors create obstacles to the lives of beings in Jambudvīpa: failed harvests, armed conflicts, being struck by poison and wind, and water problems.

source: དེ་ ལ་ གལ་ཏེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ སྐྱེ་དགུ་ [4b] དག་ འབྱུང་ ན །_ ཆོས་ དང་ ལྡན་པ འི་ ཀླུ་ དེ་དག་ སྟོབས་ དང་ ལྡན་པ ར་ འགྱུར་ ཏེ །_
en: When people are righteous and follow the Dharma, [4.b] the righteous nāgas will gain strength.

source: དེ་དག་ སྤྲིན་ ངན་པ་ དག་ སྤྲུལ་པ ར་ མི་ བྱེད་ ཅིང་ །_ དེ་དག་ སྤྲིན་ ངན་པ་ དང་ འདུ་བ ར་ མི་ བྱེད་ ལ །_ རླུང་ ངན་པ་ དག་ གཏོང་བ ར་ མི་ བྱེད་ དོ །_།
en: They will then abstain from creating any dark clouds—they will not gather any such clouds, and they will not release any troublesome storms.

source: དེ་ ཆུ་བོ་ དག་ ལ་ གནོད་པ ར་ མི་ བྱེད་ ཅིང་ ཆུ་ བཟང་པོས་ འབྲུ་ རྣམས་ ལེགས་པ ར་ སྐྱེད་ དེ །_
en: They will not disrupt the rivers but instead they will water the crops and nourish them well.

source: མེ་ཏོག་ དང་ འབྲས་བུ་ དག་ རོ་ བྲོ་བ་ དང་ །_ མདོག་ བཟང་བ་ དང་ །_ དྲི་ དང་ རོ་ ཕུན་སུམ་ ཚོགས་པ ར་ འབྱུང་ ངོ་ །_།
en: Flowers and fruits will have fine fragrances and tastes.

source: དེས་ སེམས་ཅན་ རྣམས་ དགའ་བ ར་ བྱེད་ ལ །_ ནད་ དག་ དང་ བྲལ་ ཞིང་ཁམས་ རྣམས་ སྟོབས་ དང་ ལྡན་པ ར་ འགྱུར །_
en: Thus, sentient beings will be happy, free of disease, and strong.

source: དེ་དག་ ཡང་ ལས་ ལེགས་པ་ དག་བྱེད་ ལ །_ དེ་དག་ སེམས་ཅན་ རྣམས་ ཀྱི་ དབང་ གི་ འབྲས་བུ་ ཡང་ འབྲུ་ རྣམས་ ཕུན་སུམ་ ཚོགས་པ ར་ བྱེད་ དེ །_
en: These nāgas create positive karmic actions and, as a beneficent effect for sentient beings, they also ensure that the crops are excellent.

source: དེ་ལྟ ར་ རིམ་གྱིས་ འཛམ་བུ འི་ གླིང་ གི་ མི་ རྣམས་ ལ །_ ཀླུ་ དག་ གཅེས་སྤྲས་ སེམས་པ ར་ འགྱུར་བ་ མཐོང་ ངོ་ །_།
en: Thus, these nāgas regard the people of Jambudvīpa with great affection on many levels.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ འཛམ་བུ འི་ གླིང་ སོ་སོ ར་ ཤེས་པ ར་ བྱས་ ནས །_ ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ ཀྱི་ གླིང་ ལ་ རྗེས་སུ་ སེམས་པ ར་ བྱེད་ དེ །_
en: $45 “When the monk who has knowledge of the ripening of karmic effects has examined Jambudvīpa in this way, he will next consider Godānīya in the west.

source: ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ དག་ ཇི་ལྟ ར་ ཀུན་ ཏུ་ སྲུང་བ ར་ བྱེད་ ཅིག་ གུ་ སྙམ་ མོ །_།
en: Thus, he will wonder, ‘In what ways do the righteous nāgas that follow the Dharma protect that realm?’

source: གླིང་ དེར་ མི་ ཡིད་ ཤིན་ཏུ་ འཇམ་པ་ དག་ འབྱུང་བ ར་ འགྱུར་ ལ །_
en: $46 “The people of Godānīya in the west have extremely gentle minds.

source: དེ་དག་ ལ་བར་ ཆད་ གཅིག་ འབྱུང་བ་ ནི་ འདི་ལྟ་སྟེ་ ཆུ་ རྙོག་པ་ ཅན་ ཡིན་ ཏེ །_ དེས་ ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ ཀྱི་ མི་ རྣམས་ དུས་ ཉེ་བ ར་ འདུམས་པ ར་ བྱེད་ དོ །_།
en: One obstacle that they do experience, however, is unclean water, which may shorten their lives.

source: ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ དེ་དག་ སྤྲིན་ ལྡང་བ ར་ མི་ བྱེད་ ཅིང་ ངམ་གྲོག་ དང་ །_ གཡང་ས་ དང་ རི་བོ་ མི་བཟད་པ་ རྣམས་ ལ །_ དེ་དག་ ཆུ་ རྙོག་པ་ ཅན་ མི་ འབེབས་ ལ །_ ཀླུ་ རྣམས་ ཀྱི་ མཐུ ས་ ཆུ་ རྙོག་པ་ མེད་པར་ བྱས་པ ས །_ ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ ཀྱི་ མི་ རྣམས་ བདེ་བ ར་ གནས་པ་ མཐོང་ ངོ་ །_།
en: The righteous nāga kings who follow the Dharma will not create any clouds and thereby let unclean water fall into ravines, gorges, or the mighty mountains. Instead, such nāgas will use their power to purify the water, and so the people of the western realm of Godānīya live happily.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ཤར་ གྱི་ ལུས་འཕགས་ གླིང་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $47 “Next, the monk who has knowledge of the ripening of karmic effects will consider Videha in the east, and so ask himself,

source: ཀྱེ་མ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ ཀླུ་ དག་ ཤར་ གྱི་ ལུས་འཕགས་ གླིང་ བདེ་བ ར་ བྱ་བ་ ལ་ ཇི་ལྟ ར་ འབད་ སྙམ་ ནས །_
en: ‘Well, how are the righteous nāgas that follow the Dharma able to bring happiness to Videha in the east?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ཤར་ གྱི་ ལུས་འཕགས་ ཀྱི་ མི་ རྣམས་ ལ་ གློག་ གི་ འཇིགས་པ་ དང་ །_ སྒྲ འི་ [5a] འཇིགས་ པས་ བར་ཆད་ འབྱུང་བ ར་ འགྱུར་ ཏེ །_
en: $48 “As he applies knowledge derived from hearing, he will see that the people on the eastern continent of Videha encounter obstacles in the form of frightening flashes of lightning and thunderclaps.

source: དེ་དག་ གང་ གི་ ཚེ་ གློག་ མཐོང་བ་ དང་ །_ སྒྲ་ ཐོས་པ་ དེ འི་ ཚེ་ སེམས་ ཤིན་ཏུ་ འཇམ་པ་ དག་ ལ་ ནད་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: [5.a] Seeing lightning and hearing thunder will make their extremely gentle minds unsound.

source: གང་ གི་ ཚེ་ དེར་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ ཀླུ འི་ བདག་པོ་ དག་ སྒྲ་ ཡང་ མི་ འབྱིན །_ གློག་ ཀྱང་ མི་ གཏོང་ སྟེ །_ དེ འི་ ཚེ་ ཀླུ འི་ བདག་པོ་ རྣམས་ ཀྱིས་ ཤར་ གྱི་ ལུས་འཕགས་ ཀྱི་ མི་ རྣམས་ ལ་ ནད་ འབྱུང་བ ར་ མི་ བྱེད་པ་ མཐོང་ ངོ་ །_།
en: Thus, whenever the lords of the righteous nāgas that follow the Dharma abstain from causing any thunder or lightning, this protects the humans in Videha from illness.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ མི་ རྣམས་ ཀྱི་ གནོད་པ་ ལ་ རྗེས་སུ་ སེམས་པ ར་ བྱེད་ དེ །_
en: $49 “Next, the monk who has knowledge of the ripening of karmic effects will think of the harms suffered by the humans in Kuru in the north.

source: ཀྱེ་མ་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ མི་ རྣམས་ ལ་ གནོད་པ་ ཇི་ལྟ ར་ འབྱུང་བ ར་ འགྱུར་ སྙམ་ ནས །_
en: Thus, he will ask himself, ‘What harms do the human beings in Kuru encounter?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ བྱང་ གི་ སྒྲ་ མི་ སྙན་པ་ རྣམས་ ལ་ རླུང་ གྲང་མོ ས་ གནོད་པ ར་ བྱེད་ དེ །_
en: As he examines this matter with knowledge derived from hearing, he will see that the people of Kuru in the north are vexed by cold winds.

source: སྤྲིན་ ནག་པོ ས་ གནོད་པ་ དང་ །_ རླུང་ གྲང་མོ ས་ མེ་ཏོག་ དེ་དག་ ཞུམ་པ ར་ འགྱུར་ ལ །_ དྲི་ མི་ ཞིམ་པ ར་ འགྱུར །_ དེ་ནས་ དེ་དག་ ཡིད་ མི་ དགའ་བ་ སྐྱེ་ སྟེ །_
en: Black clouds and cold winds cause the flowers there to wither and lose their pleasant scent, which makes the inhabitants of that realm despondent.

source: སྤྲིན་ ནག་པོ འི་ རྐྱེན་ གྱིས་ བྱ་ དག་ སྐད་ མི་ སྙན་པ་ འབྱིན་ ལ །_ པི་ བང་ དང་ །_ རྫ་རྔ འི་ སྒྲ་ ཡང་ མི་ སྙན་པ ར་ འགྱུར་ རོ །_།
en: Due to the presence of those black clouds, birds will no longer sing beautifully, and the sounds of lutes and clay drums will no longer be pleasing.

source: རི་ ཀུན་ ཏུ་ སྣང་བྱེད་ ལ་སོགས་པ་ ལ་ གནས་པ་ རྣམས་ ལ །_ དེ་ལྟ ར་ ཀླུ ས་ བྱས་པ་ དག་ གིས་ གནོད་པ ར་ བྱེད་ དོ །_།
en: In such ways, the activities of the nāgas may cause harm to those who live on mountains such as Mount Illuminator.

source: གང་ གི་ ཚེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ རྒྱལ་པོ་ འབྱུང་བ་ དེ འི་ ཚེ་ རླུང་ གྲང་མོ་ དག་ འབྱུང་བ ར་ མི་ འགྱུར་ ལ །_ སྤྲིན་ ནག་པོ་ ཡང་ འབྱུང་བ ར་ མི་ འགྱུར་ རོ །_།
en: Yet when righteous nāga kings who follow the Dharma appear there, there will not be any cold winds or black clouds.

source: དེ་ལྟ ར་ མི འི་ གནས་ བཞི་ དག་ ལ་ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ རྣམས་ བདེ་བ་ སྒྲུབ་པ ར་ བྱེད །_ ཕན་པ་ སྒྲུབ་པ ར་ བྱེད་ དོ །_།
en: In these ways the righteous nāga kings that follow the Dharma will bring happiness and benefit to the inhabitants of all four human abodes.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ ཀླུ འི་ འཇིག་རྟེན་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $50 “As the monk who has knowledge of the ripening of karmic effects continues to examine the world of the nāgas, he will ask himself,

source: ལས་ གང་ གིས་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ ར་ མི་ འགྱུར་ སྙམ་ ནས །_
en: ‘What actions cause nāgas to become unrighteous and abandon the Dharma?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ཇི་ལྟ ར་ ཀླུ འི་ གནས་ ལོངས་སྤྱོད་ ལྡན་ ན །_ ཀླུ་ རྣམས་ ཀྱི་ རྒྱལ་པོ་ ཆོས་ དང་ མི་ ལྡན་པ་ འདི་ལྟ་སྟེ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ བསྒྱིངས་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ནག་པོ་ དང་ །_ ཀླུ འི་ [5b] རྒྱལ་པོ་ ཧུ་ ལུ་ ཧུ་ ལུ་ སྟེ །_
en: $51 “When he examines this matter with knowledge derived from hearing, he will notice that the nāga realm known as Endowed with Enjoyments contains the following unrighteous nāga kings: the nāga king Pramatha, the nāga king Aṭopa, the nāga king Kāla, [5.b] and the nāga king Huluhulu.

source: དེ་དག་ རྒྱ་མཚོ་ བར་མ་ ལོངས་སྤྱོད་ ལྡན་ ན་ གནས་ སོ །_།
en: All of these reside in the realm known as Endowed with Enjoyments within the middle ocean.

source: ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ ར་ མི་ བྱེད་པ་ དེ་དག་ གི་ མཐུ་ ཇི་ལྟ་བུ་ ཡིན་ སྙམ་ ནས །_ དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གང་ གི་ ཚེ་ དགེ་སྦྱོང་ དུ་ མི་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ མི་ འཛིན་པ འི་ སྐྱེ་དགུ་ དག་ འབྱུང་བ་ དེ འི་ ཚེ །_ ཀླུ་ དེ་དག་ གི་ དབང་ དུ་ འགྱུར་ རོ །_།
en: $52 “Wondering what powers the unrighteous nāga kings possess, the monk will apply knowledge derived from hearing and so notice how those nāgas hold sway whenever people do not respect mendicants or brahmins.

source: དེ འི་ ཚེ་ དེ་དག་ འཛམ་བུ འི་ གླིང་ དུ་ སེམས་ གདུག་ ཅིང་ ལུས་ ལས་ དུག་ མང་པོ་ འབྱུང་བ ར་ བྱེད་ དེ །_
en: In Jambudvīpa those nāgas will then create hostility and emit poison from their bodies.

source: དེ་དག་ སྤྲིན་ ངན་པ འི་ ནང་ ན་ རྒྱུ་ ཞིང་ དུག་ གི་ ཤིང་ ལྗོན་པ་ འབྱུང་བ ར་ བྱེད་ དེ །_
en: They will move within black clouds and cause poisonous trees to grow.

source: དེ་དག་ གིས་ རླུང་ མ་ རུང་བ ར་ བྱེད །_ རླུང་ དེས་ ཆུ་མ་ རུང་བ ར་ བྱེད །_ ཆུ་མ་ རུང་བ ར་ བྱས་པ་ དེས །_ འབྲུ འི་ ཚོགས་ ཤིན་ཏུ་ མ་ རུང་བ ར་ བྱེད་ དེ །_ ཁ་ཟས་ དེ་ ཟོས་པ་ ལས་ ནད་ དག་ རབ་ཏུ་འཁྲུག་ པར་ བྱེད་ དོ །_།
en: They will stir harmful winds that spoil the water, which in turn spoil the crops, so that those who consume them are stricken by severe disease.

source: འབྲུ་མ་ རུང་བ ར་ བྱས་པ་ དེས་ ཚེ་ དག་ ཐུང་བ ར་ འགྱུར་ ཏེ །_ དེ་ལྟ ར་ རྒྱལ་པོ་ ཉེས་པ་ ཆེ་ ཞིང་ སྡང་བ ས་ ཀྱང་ ཕན་ཚུན་ གསོད་པ་ དག་བྱེད་ དོ །_།
en: As the crops are ruined, the lifespan of people will shorten, and wicked and aggressive kings will kill each other.

source: དེ་ནས་ ཉེས་པ་ དེས་ འཛམ་བུ འི་ གླིང་ གི་ མི་ དག་ རབ་ཏུ་ ཉུང་བ ར་ འགྱུར་ ཏེ །_
en: Due to such drawbacks, the number of humans in Jambudvīpa will greatly diminish.

source: རྐྱེན་ འདི ས་ ཀླུ་ མ་རུངས་པ་ རྣམས་ བར་ཆད་ བྱེད་པ ར་ འགྱུར་བ་ མཐོང་ ངོ་ །_།
en: These are the ways that evil nāgas create obstacles.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ ཀླུ འི་ རྒྱལ་པོ་ ལ་སོ་ སོར་ རྟོག་པ ར་ བྱེད་ དེ །_ ཆོས་ དང་ མི་ ལྡན་པ འི་ རྒྱལ་པོ་ དག་ ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ ཀྱི་ མི་ རྣམས་ ཀྱི་ བར་ཆད་ ཇི་ལྟ ར་ བྱེད་ ཅིག་ གུ་ སྙམ་ ནས །_
en: $53 “As the monk who has knowledge of the ripening of karmic effects concerns himself with the nāga kings, he will next ask himself how the unrighteous nāga kings may cause obstacles for humans living in Godānīya in the west.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གང་ གི་ ཚེ་ མི་ རྣམས་ ཀྱི་ རྒྱལ་པོ་ ཆོས་ དང་ མི་ ལྡན་པ་ དེ་དག་ འབྱུང་བ་ དེ འི་ ཚེ །_
en: Applying knowledge derived from hearing, he will then see that that realm is ruled by unrighteous human kings.

source: ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ དག་ ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ ཀྱི་ ངམ་གྲོག་ དང་ །_ གཡང་ས་ དང་ །_ རི་བོ འི་ རྩེ་ མི་བཟད་པ་ རྣམས་ ལ་ཆ ར་ དབྱུག་པ་ ལྟ་བུ་ འབེབས་པ ར་ བྱེད་ དེ
en: Unrighteous nāga kings that do not follow the Dharma will cause a toxic rain to fall in all the ravines, gorges, and mighty mountain peaks.

source: ཆར་པ འི་ ཆུ་ དེས་ ཆུ་ རྙོག་པ་ ཅན་ དུ་ བྱེད་ དོ །_། ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ ཀྱི་ མི་ རྣམས་ དེ་ ལ་ འཐུང་བ ར་ བྱེད་ དེ །_ བར་ཆད་ བྱེད་པ འི་ རྒྱུ་ ནི་ འདི་ ཡིན་ ནོ །_།
en: This rainwater will pollute the water table in general, and so, when consumed by the people of Godānīya in the west, it will cause them obstacles.

source: དགེ་སློང་ དེ་ ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ ཀྱི་ གླིང་ ལ་ ཡང་དག་པ་ ཇི་ལྟ་ བ་ བཞིན་ སོ་སོ ར་ བརྟགས་ ནས །_ ནང་ གི་ སོ་སོ ར་ རིག་པ ར་ བྱེད་ དོ །_།
en: Thus, the monk will correctly examine Godānīya in the west, and become aware of this.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ ཤར་ གྱི་ ལུས་འཕགས་ གླིང་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $54 “Next, the monk who has knowledge of the ripening of karmic effects will examine Videha in the east.

source: དེས་ [6a] ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གང་ གི་ ཚེ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ འབྱུང་བ་ དེ འི་ ཚེ་ ཀླུ འི་ བདག་པོ་ མ་རུངས་པ་ དག་ གི་ སྟོབས་ རབ་ཏུ་ ཆེ་བ ར་ འགྱུར་ རོ །_།
en: [6.a] Applying knowledge derived from hearing, he will see that when unrighteous people who do not follow the Dharma appear, it will make the hostile nāgas become powerful.

source: དེ་དག་ ཤར་ གྱི་ ལུས་འཕགས་ གླིང་ དུ་ སྒྲ་ རབ་ཏུ་ ཆེན་པོ ར་ འབྱིན་ ཏེ །_
en: They will then produce very loud thunderclaps in Videha in the east.

source: འདི་ལྟ་སྟེ །_ རི་ ཆེན་པོ་ སྙིལ་བ་ ན་ སྒྲ་ འབྱུང་བ་ དེ་ལྟ་ བུ་ དེ་དག་ ཐོས་ ནས །_
en: The noise will be as loud as if a mountain were being crushed.

source: ཤར་ གྱི་ ལུས་འཕགས་ གླིང་ གི་ མི་ རྣམས་ ཀྱི་ སྙིང་ ཤིན་ཏུ་ འཇམ་པ ར་ མི་ འགྱུར་ ཏེ །_ དེ་དག་ ཁ་ཅིག་ ནད་ ཀྱིས་ འདེབས་ སོ །_།
en: When the people in Videha hear this, their hearts will be disturbed, and some will even become sick.

source: དེ་བཞིན་ དུ་ གློག་ ཀྱང་ འབྱིན་ ཏེ །_ འདི་ལྟར་ ཕྱོགས་ བཅུ་ ཐམས་ཅད་ འབར་བ འི་ ཕྲེང་བ ས་ འཁྲུགས་པ ར་ འགྱུར་ ཞིང་ སྤྲིན་ གྱི་ ནང་ དུ་ ཞུགས་པ འི་ ཀླུ་ དེ་དག་ གཟུགས་ འཇིགས་ འཇིགས་ ལྟར་ བསྒྱུར་བ །_
en: The nāgas will also produce flashes of lightning that shoot tongues of flames in the ten directions, while the nāgas dwelling in the clouds take on frightening forms.

source: མིག་ ནི་ ཤིང་རྟ འི་ འཁོར་ལོ་ ཙམ །_ གཟུགས་ ནི་ རི་ ནག་པོ་ འདྲ་ ལ་མགོ་ གསུམ་པོ་ ལས་ མེ་ ཐམས་ཅད་ གཏོང་ ཞིང་ ཁྱི འི་ གཟུགས་ དང་ །_ སྦྲུལ་ གྱི་ གཟུགས་ ཏེ །_
en: Their eyes will be as large as chariots, their bodies will be like black mountains, and fire will burn from their three heads.

source: གཟུགས་ དུ་མ །_ གཟུགས་ མི་བཟད་པ་ དག་ མཐོང་ ངོ་ །_།
en: They can also assume the forms of dogs, snakes, and many other horrible forms.

source: དེ་དག་ མཐོང་ ནས་ ཤར་ གྱི་ ལུས་འཕགས་ གླིང་ གི་ མི་ རྣམས་ ཀྱི་ བར་ཆད་ དུ་ འགྱུར་བ་ མཐོང་ ངོ་ །_།
en: Seeing all this will create obstacles for the people of Videha in the east.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ མཐོ་རིས་ ལས་ གཞན་པ་ མཐོ་རིས་ ཀྱི་ འཇིག་རྟེན་ གཉིས་པ་ ལྟ་བུ །_ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ གླིང་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $55 “Next, the monk who has knowledge of the effects of the ripening of karmic action will examine Kuru in the north, which, although different from the heavens, is like a second heaven.

source: ཀླུ འི་ བདག་པོ་ མ་རུངས་པ་ དག་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ མི་ རྣམས་ ལ་ ཇི་ལྟ ར་ གནོད་པ་ སྐྱེད་པ ར་ བྱེད་ སྙམ་ ནས །_
en: Thus, he will wonder, ‘How do the hostile nāga lords cause harm to the people of Kuru in the north?’
